class DeedsReward {
  static const List<String> fasting = [
    "من صام يوما في سبيل الله بَعَّدَ الله وجهه عن النار سبعين خريفا",
  ];

  /// ****************************

  static const List<String> obligatoryPrayers = [
    "خمس صلوات كتبهن الله على العباد من جاء بهن لم يضيع منهن شيئًا استخفافًا بحقهن كان له عند الله عهدٌ أن يدخله الجنة ومن لم يأت بهن فليس له عند الله عهدٌ إن شاء عذبه وإن شاء أدخله الجنة",
    "العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر",
    "أول ما يحاسب به العبد يوم القيامة الصلاة، فإن صلحت صلح سائر عمله، وإن فسدت فسد سائر عمله",
  ];

  /// ****************************

  static const List<String> fajrPre = [
    "ركعتا الفجر خير من الدنيا وما فيها",
  ];
  static const List<String> doha = [
    "لا يحافظ على صلاة الضحى إلا أوَّاب",
    "يصبح على كل سلامى من أحدكم صدقة، فكل تسبيحة صدقة، ... ويجزئ من ذلك ركعتان يركعهما من الضحى",
  ];
  static const List<String> nightPrayer = [
    " ينزل ربنا تبارك وتعالى كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول: من يدعوني فأستجيب له، من يسألني فأعطيه، من يستغفرني فأغفر له.",
    "من قام بعشر آيات لم يكتب من الغافلين، ومن قام بمائة آية كتب من القانتين، ومن قام بألف آية كتب من المقنطرين",
  ];
  static const List<String> additionalPrayers = [
    """
من صلى في يوم وليلة ثنتي عشرة ركعة تطوعا غير فريضة بنى الله له بيتا في الجنة
ركعتين قبل الفجر وأربعا قبل الظهر وركعتين بعدها وركعتين بعد المغرب وركعتين بعد العشاء""",
  ];

  /// ****************************

  static const List<String> azkar = [
    """
قال الحافظ ابن الصلاح -رَحِمهُ الله:
مـن حافظ على أذكار الصباح والمساء وأذكار بعد الصلوات وأذكار النوم عُدّ من الذاكـرين الله كثيراً""",
  ];
  static const List<String> quran = [
    "فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ",
    "إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَّن تَبُورَ",
  ];
}
