Repository: muslimpack/mudawanat_aleibadat
Catalog: mudawanat_aleibadat/lib/l10n/intl_*.arb
Languages: ar

source: App Color
ar: لون التطبيق

source: App Language
ar: لغة التطبيق

source: App Theme
ar: مظهر التطبيق

# appTitle
source: Mudawanat Aleibadat
ar: مدونة العبادات

source: App Version
ar: إصدار التطبيق

source: Awrad
ar: أوراد

# awrad_azkar
source: Wird AlAzkar
ar: أذكار

# awrad_quran
source: Wird AlQuran
ar: ورد القرآن

source: Calender
ar: التقويم

source: Close
ar: اغلاق

source: Count
ar: الإجمالي

source: Daily Deeds
ar: أعمال اليوم

source: Dark Mode
ar: المظهر الليلي

source: Done
ar: تم

source: Fasting
ar: الصوم

source: General
ar: عام

source: Missed Deeds
ar: الأعمال الفائتة

# prayer_additional
source: Additional Prayers
ar: النوافل

# prayer_asr
source: Asr
ar: العصر

# prayer_asr_pre
source: Asr Pre
ar: العصر القبليه

# prayer_dhuhr
source: Dhuhr
ar: الظهر

# prayer_dhuhr_after
source: Dhuhr After
ar: الظهر البعديه

# prayer_dhuhr_pre
source: Dhuhr Pre
ar: الظهر القبليه

# prayer_doha
source: Doha
ar: الضحى

# prayer_fajr
source: Fajr
ar: الفجر

# prayer_fajr_pre
source: Fajr Pre
ar: ركعتا الفجر

# prayer_ishaa
source: Ishaa
ar: العشاء

# prayer_ishaa_after
source: Ishaa After
ar: العشاء البعديه

# prayer_ishaa_pre
source: Ishaa Pre
ar: العشاء القبليه

# prayer_maghrib
source: Maghrib
ar: المغرب

# prayer_maghrib_after
source: Maghrib After
ar: المغرب البعدية

# prayer_maghrib_pre
source: Maghrib Pre
ar: المغرب القبلية

source: Prayer Name
ar: اسم الصلاة

# prayer_night_prayer
source: Night Prayer
ar: قيام الليل

# prayer_obligatory
source: Obligatory Prayers
ar: الفروض

source: Select
ar: تعيين

source: Select Color
ar: اختر لونا

source: Settings
ar: الإعدادات

source: Statistics
ar: إحصائيات

# timesDone
source: Done Times
ar: مرات القضاء

source: Times Missed
ar: مرات الفائت

source: Use Material3
ar: استخدام Material3

source: Use Old Theme
ar: استخدم المظهر القديم
